export interface RegionItem {
	name: string;
	cities: { name: string; districts: string[] }[];
}

export const REGION_DATA: RegionItem[] = [
	{ name: "全国", cities: [{ name: "不限", districts: ["不限"] }] },
	{
		name: "北京市",
		cities: [
			{
				name: "北京市",
				districts: [
					"不限",
					"东城区",
					"西城区",
					"朝阳区",
					"海淀区",
					"丰台区",
					"石景山区",
					"通州区",
					"大兴区",
					"顺义区",
					"房山区",
					"昌平区",
					"密云区",
					"延庆区",
					"平谷区",
					"怀柔区",
					"门头沟区",
				],
			},
		],
	},
	{
		name: "上海市",
		cities: [
			{
				name: "上海市",
				districts: [
					"不限",
					"黄浦区",
					"徐汇区",
					"长宁区",
					"静安区",
					"普陀区",
					"虹口区",
					"杨浦区",
					"浦东新区",
					"闵行区",
					"宝山区",
					"嘉定区",
					"松江区",
					"青浦区",
					"奉贤区",
					"金山区",
					"崇明区",
				],
			},
		],
	},
	{
		name: "天津市",
		cities: [
			{
				name: "天津市",
				districts: [
					"不限",
					"和平区",
					"河东区",
					"河西区",
					"南开区",
					"河北区",
					"红桥区",
					"东丽区",
					"西青区",
					"津南区",
					"北辰区",
					"武清区",
					"宝坻区",
					"宁河区",
					"静海区",
					"蓟州区",
					"滨海新区",
				],
			},
		],
	},
	{
		name: "重庆市",
		cities: [
			{
				name: "重庆市",
				districts: [
					"不限",
					"渝中区",
					"江北区",
					"南岸区",
					"沙坪坝区",
					"九龙坡区",
					"大渡口区",
					"渝北区",
					"巴南区",
					"北碚区",
					"万州区",
					"涪陵区",
					"黔江区",
					"长寿区",
					"江津区",
					"合川区",
					"永川区",
					"璧山区",
					"铜梁区",
					"潼南区",
					"荣昌区",
				],
			},
		],
	},
	{
		name: "广东省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{ name: "广州市", districts: ["不限", "越秀区", "海珠区", "荔湾区", "天河区", "白云区", "黄埔区", "番禺区", "花都区", "南沙区", "从化区", "增城区"] },
			{ name: "深圳市", districts: ["不限", "福田区", "罗湖区", "南山区", "宝安区", "龙岗区", "龙华区", "光明区", "坪山区", "盐田区", "大鹏新区"] },
			{ name: "东莞市", districts: ["不限", "莞城街道", "东城街道", "南城街道", "万江街道", "虎门镇", "长安镇", "厚街镇", "大朗镇", "塘厦镇", "常平镇"] },
			{ name: "佛山市", districts: ["不限", "禅城区", "南海区", "顺德区", "高明区", "三水区"] },
		],
	},
	{
		name: "浙江省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{
				name: "杭州市",
				districts: ["不限", "上城区", "拱墅区", "西湖区", "滨江区", "萧山区", "余杭区", "临平区", "钱塘区", "富阳区", "临安区", "桐庐县", "淳安县", "建德市"],
			},
			{ name: "宁波市", districts: ["不限", "海曙区", "江北区", "北仑区", "镇海区", "鄞州区", "奉化区", "余姚市", "慈溪市", "象山县", "宁海县"] },
		],
	},
	{
		name: "江苏省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{ name: "南京市", districts: ["不限", "玄武区", "秦淮区", "建邺区", "鼓楼区", "浦口区", "栖霞区", "雨花台区", "江宁区", "六合区", "溧水区", "高淳区"] },
			{ name: "苏州市", districts: ["不限", "姑苏区", "吴中区", "相城区", "吴江区", "虎丘区", "常熟市", "张家港市", "昆山市", "太仓市"] },
		],
	},
	{
		name: "四川省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{
				name: "成都市",
				districts: [
					"不限",
					"锦江区",
					"青羊区",
					"金牛区",
					"武侯区",
					"成华区",
					"龙泉驿区",
					"青白江区",
					"新都区",
					"温江区",
					"双流区",
					"郫都区",
					"新津区",
					"都江堰市",
					"彭州市",
					"邛崃市",
					"崇州市",
					"简阳市",
					"金堂县",
					"大邑县",
					"蒲江县",
				],
			},
		],
	},
	{
		name: "湖北省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{
				name: "武汉市",
				districts: ["不限", "江岸区", "江汉区", "硚口区", "汉阳区", "武昌区", "洪山区", "青山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"],
			},
		],
	},
	{
		name: "陕西省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{
				name: "西安市",
				districts: ["不限", "新城区", "碑林区", "莲湖区", "灞桥区", "未央区", "雁塔区", "阎良区", "临潼区", "长安区", "高陵区", "鄠邑区", "蓝田县", "周至县"],
			},
		],
	},
	{
		name: "湖南省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{ name: "长沙市", districts: ["不限", "芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "望城区", "长沙县", "浏阳市", "宁乡市"] },
		],
	},
	{
		name: "河南省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{
				name: "郑州市",
				districts: ["不限", "中原区", "二七区", "管城回族区", "金水区", "上街区", "惠济区", "巩义市", "荥阳市", "新密市", "新郑市", "登封市", "中牟县"],
			},
		],
	},
	{
		name: "山东省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{ name: "青岛市", districts: ["不限", "市南区", "市北区", "黄岛区", "崂山区", "李沧区", "城阳区", "即墨区", "胶州市", "平度市", "莱西市"] },
		],
	},
	{
		name: "福建省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{ name: "厦门市", districts: ["不限", "思明区", "湖里区", "集美区", "海沧区", "同安区", "翔安区"] },
		],
	},
	{
		name: "安徽省",
		cities: [
			{ name: "不限", districts: ["不限"] },
			{ name: "合肥市", districts: ["不限", "瑶海区", "庐阳区", "蜀山区", "包河区", "肥东县", "肥西县", "长丰县", "庐江县", "巢湖市"] },
		],
	},
];
